# -*- mode: Org; org-download-image-dir: "./imgs/"; -*-

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../assets/css/style.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/9.3.0/styles/default.min.css"/>
#+HTML_HEAD: <script src="https://cdnjs.cloudflare.com/ajax/libs/jquery/2.1.3/jquery.min.js"></script>
#+HTML_HEAD: <script src="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/9.3.0/highlight.min.js"></script>
#+HTML_HEAD: <script src="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/9.3.0/languages/lisp.min.js"></script>
#+HTML_HEAD: <script>hljs.initHighlightingOnLoad();</script>
#+HTML_HEAD: <script src="https://cdnjs.cloudflare.com/ajax/libs/jquery.lazyload/1.9.1/jquery.lazyload.js"></script>
#+HTML_HEAD: <script src="../assets/js/hl_toc.js"></script>
#+HTML_HEAD: <meta name="viewport" content="width=device-width, initial-scale=1">

#+AUTHOR: Li Xinyang
#+CREATOR: Li Xinyang
#+TITLE: Introduction to Computer Science
#+EMAIL: mail@li-xinyang.com

The study note for this course may not as detail as the first one because I have watched this course many times when I first started learning how to do programming. However, I never /fully/ complete this course even once. The detailed course note can be found at http://cs50.tv.

*** TODO Merge Sort

Merge sort is to sort smaller arrays and then combine those arrays together in sorted order, with computation complext of $O(n log n)$ and $\Omega(n log n)$. Merge sort leverages recursion.

#+BEGIN_SRC 
Sort the left half of the array (assuming n > 1)
Sort the right half of the array (assuming n > 1)
Merge the two halves together
#+END_SRC

#+BEGIN_SRC python 
  def merge_sort(arr):
      if len(arr) == 1:
          return arr
      else:
          mid = len(arr) / 2
          l = merge_sort(arr[:mid])
          r = merge_sort(arr[mid:])
      sorted = []
      i = j = 0
      while i < len(l) and j < len(r):
          if l[i] < r[j]:
              sorted.append(l[i])
              i += 1
          else:
              sorted.append(r[j])
              j += 1
      sorted += l[i:]
      sorted += r[j:]
      return sorted

  return merge_sort([4, 3, 2, 1])
#+END_SRC

#+RESULTS:
| 1 | 2 | 3 | 4 |

#+header: :main no :exports both
#+BEGIN_SRC C
  #include <stdio.h>
  #include <stdlib.h>

  void merge(int* ap, int* lp, int lCount, int* rp, int rCount);
  void mergeSort(int* ap, int n);

  int main() {
	  int a[] = {4, 3, 2, 1};
    int n = sizeof(a)/sizeof(int);
    mergeSort(a, n);

    for (int i = 0; i < n; i++) {
      printf("%d ", a[i]);
    }
    printf("\n");

    return 0;
  }

  void merge(int* ap, int* lp, int lCount, int* rp, int rCount) {
    int i, j, k;
    i = 0; j = 0; k = 0;

    while (i < lCount && j < rCount) {
      if (lp[i] < rp[j]) ap[k++] = lp[i++];
      else ap[k++] = rp[j++];
    }
    while(i < lCount) ap[k++] = lp[i++];
    while(j < rCount) ap[k++] = rp[j++];
  }

  void mergeSort(int* ap, int n) {
    int mid, i, *lp, *rp;
    if (n < 2) return;

    mid = n / 2;

    lp = (int*)malloc(mid * sizeof(int));
    rp = (int*)malloc((n - mid) * sizeof(int));

    for (i = 0; i < mid; i++) lp[i] = ap[i];
    for (i = mid; i < n; i++) rp[i - mid] = ap[i];

    mergeSort(lp, mid);
    mergeSort(rp, n - mid);
    merge(ap, lp, mid, rp, n - mid);
    free(lp);
    free(rp);
  }
#+END_SRC

#+RESULTS:
: 1 2 3 4

